In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("disposable_inc.csv")
df.head()

       DATE  A229RX0
0  1/1/2013    38891
1  2/1/2013    38679
2  3/1/2013    38720
3  4/1/2013    38853
4  5/1/2013    39054

In [3]:
df.rename(columns = {'DATE': 'Date', 'A229RX0':'Income'}, inplace = True)

In [4]:
df.head()

       Date  Income
0  1/1/2013   38891
1  2/1/2013   38679
2  3/1/2013   38720
3  4/1/2013   38853
4  5/1/2013   39054

In [5]:
df['month'] = pd.DatetimeIndex(df['Date']).month
df.head()

       Date  Income  month
0  1/1/2013   38891      1
1  2/1/2013   38679      2
2  3/1/2013   38720      3
3  4/1/2013   38853      4
4  5/1/2013   39054      5

In [6]:
df['month_year'] = pd.to_datetime(df['Date']).dt.to_period('M')
df.head()

       Date  Income  month month_year
0  1/1/2013   38891      1    2013-01
1  2/1/2013   38679      2    2013-02
2  3/1/2013   38720      3    2013-03
3  4/1/2013   38853      4    2013-04
4  5/1/2013   39054      5    2013-05

In [8]:
df.to_csv('disposable_inc.csv')